Revit 2017 API
ViewDisplayDepthCueing Class
 Represents the settings for depth cueing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2017
Syntax
C#
public class ViewDisplayDepthCueing : IDisposable
Visual Basic
Public Class ViewDisplayDepthCueing _
	Implements IDisposable
Visual C++
public ref class ViewDisplayDepthCueing : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ViewDisplayDepthCueing
See Also
ViewDisplayDepthCueing Members
Autodesk.Revit.DB Namespace